In [2]:
import mysql.connector as connector
import pandas as pd
import json

In [3]:
#Import credentials
with open('Other/Data.json', 'r') as f:
    credentials = json.load(f)

In [6]:
conn = connector.connect(user = credentials['user'], password = credentials['password'])
cur = conn.cursor()

In [8]:
cur.execute('USE littlelemondb;')

In [9]:
conn.database

'littlelemondb'

### Task two
In this second task, you now need to query the database to show all tables within the database. Having established a connection in the first task, you need to execute a test query to ensure that there are no issues. You can do this by executing, or passing, a generic query that returns a snapshot of the database tables.

In [10]:
show_tables_query = "SHOW TABLES;" 
cur.execute(show_tables_query)
cols = cur.column_names
rows = cur.fetchall()

In [11]:
print(cols)
for i in rows:
    print(i)

('Tables_in_littlelemondb',)
('bookings',)
('customer',)
('delivery',)
('employee',)
('menu',)
('menuitems',)
('orders',)
('ordersview',)

In [15]:
#Format outputs into Pandas Dataframes for better readability
def getOutput(cols, rows):
    return pd.DataFrame(rows, columns = cols)

### Task 3
For the third and final task, Little Lemon need you to return specific details from your database. They require the full name and contact details for every customer that has placed an order greater than $60 for a promotional campaign.

In [13]:
get_customer_details = '''
SELECT DISTINCT(c.CustomerName), c.ContactNumber FROM Customer c 
JOIN Bookings b ON c.CustomerID = b.CustomerID 
JOIN Orders o ON o.BookingID = b.BookingID 
WHERE o.TotalCost > 60;'''

In [14]:
cur.execute(get_customer_details)
cols = cur.column_names
rows = cur.fetchall()

In [16]:
getOutput(cols, rows)

          CustomerName  ContactNumber
0       Nicolle Lardge        9476459
1  Xaviera Du Plantier        2687532
2       Brinn McCullum        1251464
3       Karena Jenicke        8338349
4  Adolpho De Emanuele        8486297
5         Julie Tallyn        3228539
6     Nanette Trinkwon        1167555
7         Trixie Queen        6245809
8     Idalina Prudence        3755652